//Трищенкова
/*
Часы показывают время в 24-часовом формате. 
H - количество полных часов, прошедших с полуночи (от 0 до 23),
M - количество минут, прошедших с начала часа (от 0 до 59),
S - количество секунд, прошедших в текущей минуте (от 0 до 59).
Нужно, зная текущие показания часов, определить, что они будут показывать через K (от 0 до 1000000) секунд.

in: 12 34 9 57
out: 12 35 6
*/
#include <stdio.h>

int main(){
    int h, m, s, k;
    scanf("%d %d %d %d", &h, &m, &s, &k);
    int dopm = (s + k) / 60;
    s = (s + k) % 60;
    int doph = (m + dopm) / 60;
    m = (m + dopm) % 60;
    h = (h + doph) % 24;
    printf("%d %d %d", h, m, s);
}